/*
학교 도서관 관리 프로그램을 이어서 작성한다.

현재 학생 관리 프로그램은 학생들에 대한 체계적인 관리에 어렵다.

그 이유로는 첫째로 불분명한 순서로 저장된 학생들을 꼽을 수 있다.

그리하여 학생들을 학번순으로 나열하는 함수를 작성하고자 한다.

인터넷으로 "버블정렬"이라는 것을 검색해보면 많은 자료들이 나오므로 참고해본다면 좋을 것이다.

--

파일 입출력하는 텍스트 파일을 20150802_최수연.txt로 교체한다

해당 텍스트파일에는 200명의 자료가 들어있다.

--
학교에서 다독왕을 선정하고자 한다.

다독왕은 누적 대여 권수가 가장 많은 순서대로 한다.

(공동으로 선정된다 해도 선정된 학생 숫자에는 제한이 없다)

cf) 2등이 2명이라고 해서 3등이 사라지고 4등으로 넘어가는 일 X

전체 1등부터 10등까지의 학생에게 상품권을 나누어 주려고 한다.


1등 10만원
2등 9만원
3등 8만원
...
10등 1만원

상금을 이렇게 분배해준다고 했을때

특정 학생을 검색했을 때 그 학생이 상품을 받을 수 있는 학생인지

몇권을 읽었는지 상품권을 얼마를 받을 수 있는지 출력하는 함수를 작성해보자.
*/