/*
1. 구조체.

학교 도서관의 도서 대여 관리 시스템을 프로그래밍해보고자 한다.

학교 도서관에서 사용할 데이터는

(1)학생의 학번
(2)학생의 학년
(3)누적 대여 권수
(4)현재 대여 권수
(5)잔여 반납일(모든 책은 같은 날짜에 대여했다고 가정한다. 모든 책은 2주간 대여가 가능하다)

라고 한다.

위 데이터로 프로그래밍하기 위해서 [1]. 구조체를 설계해보자.

[2]. 학교의 총 학생이 500명이라고 한다.

[3]. 본교 학생들의 정보를 50명만 출력하는 함수를 작성해보자.

[4]. 20150801_최수연Data.txt 파일에 20명의 학생의 정보가 입력되어 있다.
이를 파일입출력을 이용하여 학생의 정보에 저장해보자.

[5]. 학생의 정보를 추가하는 함수를 작성해보자.

[6]. 학생의 정보를 삭제하는 함수를 작성해보자.

[7]. 학생의 정보를 검색하는 함수를 작성해보자.

[8]. 총 몇명의 학생이 등록되었는지 등록된 학생의 수를 검사하는 함수를 작성해보자.


*/